# AULA - 14

## Aprofundamento no Pandas

Neste notebook, serão abordados os seguintes tópicos:
> Concatenar, Juntar e mesclar

> Operações

> Entrada e saida de dados

In [70]:
import numpy as np
import pandas as pd

### Concatenar, juntar e mesclar

Há 3 formas de juntar DataFrames, estas serão os tópicos desta aula.

### Concatenação

In [71]:
df1 = pd.DataFrame({'A':[1,2,3,4], 'B':[5,6,7,8], 'C':[9,10,11,12], 'D': [13,14,15,16]},
                   index = ['x','y','z','k'])
df2 = pd.DataFrame({'A':[17,18,19,20], 'B':[21,22,23,24], 'C':[25,26,27,28], 'D': [29,30,31,32]},
                   index = ['J','i','t','r'])
df3 = pd.DataFrame({'A':[33,34,35,36], 'B':[37,38,39,40], 'C':[41,42,43,44], 'D': [45,46,47,48]},
                   index = ['s','l','n','m'])

Os DataFrames acima são para exemplificar as de concatenação.

In [72]:
df1

   A  B   C   D
x  1  5   9  13
y  2  6  10  14
z  3  7  11  15
k  4  8  12  16

In [73]:
df2

    A   B   C   D
J  17  21  25  29
i  18  22  26  30
t  19  23  27  31
r  20  24  28  32

In [74]:
df3

    A   B   C   D
s  33  37  41  45
l  34  38  42  46
n  35  39  43  47
m  36  40  44  48

A concatenação é basicamente a colagem de DataFrames, lembrando que eles precisam ter as mesmas dimensões em relação ao eixo que estão sendo concatenados.

In [75]:
pd.concat([df1,df2,df3])

    A   B   C   D
x   1   5   9  13
y   2   6  10  14
z   3   7  11  15
k   4   8  12  16
J  17  21  25  29
i  18  22  26  30
t  19  23  27  31
r  20  24  28  32
s  33  37  41  45
l  34  38  42  46
n  35  39  43  47
m  36  40  44  48

Por padrão, a concatenação utiliza pelas colunas iguais, porém se adicionarmos "axis = 1", nos parâmetros ele passará a utilizar as linhas dos índices como comparação.

In [76]:
pd.concat([df1,df2,df3], axis = 1)

C:\Users\andre\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     A    B     C     D     A     B     C     D     A     B     C     D
J  NaN  NaN   NaN   NaN  17.0  21.0  25.0  29.0   NaN   NaN   NaN   NaN
i  NaN  NaN   NaN   NaN  18.0  22.0  26.0  30.0   NaN   NaN   NaN   NaN
k  4.0  8.0  12.0  16.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
l  NaN  NaN   NaN   NaN   NaN   NaN   NaN   NaN  34.0  38.0  42.0  46.0
m  NaN  NaN   NaN   NaN   NaN   NaN   NaN   NaN  36.0  40.0  44.0  48.0
n  NaN  NaN   NaN   NaN   NaN   NaN   NaN   NaN  35.0  39.0  43.0  47.0
r  NaN  NaN   NaN   NaN  20.0  24.0  28.0  32.0   NaN   NaN   NaN   NaN
s  NaN  NaN   NaN   NaN   NaN   NaN   NaN   NaN  33.0  37.0  41.0  45.0
t  NaN  NaN   NaN   NaN  19.0  23.0  27.0  31.0   NaN   NaN   NaN   NaN
x  1.0  5.0   9.0  13.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
y  2.0  6.0  10.0  14.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
z  3.0  7.0  11.0  15.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN

### Mesclar

A função de mesclagem faz com que vários DataFrames se tornem um só, porém sem replicar alguma linha ou tabela já existente.

In [77]:
dfMrg1 = pd.DataFrame({'A':[1,2,3,4], 'B':[5,6,7,8], 'C':[9,10,11,12], 'D': [13,14,15,16]},
                   index = [0,1,2,3])
dfMrg2 = pd.DataFrame({'D':[1,2,3,4], 'E':[5,6,7,8], 'C':[9,10,11,12], 'K': [13,14,15,16]},
                   index = [0,1,2,3])
dfMrg1

   A  B   C   D
0  1  5   9  13
1  2  6  10  14
2  3  7  11  15
3  4  8  12  16

In [78]:
dfMrg2

   D  E   C   K
0  1  5   9  13
1  2  6  10  14
2  3  7  11  15
3  4  8  12  16

In [79]:
pd.merge(dfMrg1,dfMrg2, on = 'C')

   A  B   C  D_x  D_y  E   K
0  1  5   9   13    1  5  13
1  2  6  10   14    2  6  14
2  3  7  11   15    3  7  15
3  4  8  12   16    4  8  16

### Juntar

O método para juntar DataFrames, diferentemente dos outros, é aplicado a uma variável, e ele irá combinar os DataFrames passados, agregando colunas na tabela.

In [80]:
dfJoin = pd.DataFrame({'A':[1,2,3,4], 'B':[5,6,7,8]},
                   index = ['x','y','z','k'])
dfJoin1 = pd.DataFrame({'C':[1,2,3,4], 'D':[5,6,7,8]},
                   index = ['x','y','z','k'])

In [81]:
dfJoin

   A  B
x  1  5
y  2  6
z  3  7
k  4  8

In [82]:
dfJoin1

   C  D
x  1  5
y  2  6
z  3  7
k  4  8

In [83]:
dfJoin.join(dfJoin1)

   A  B  C  D
x  1  5  1  5
y  2  6  2  6
z  3  7  3  7
k  4  8  4  8

### Operações

In [84]:
df = pd.DataFrame({'col1': [1,2,3,4], 'col2': [444,555,666,444], 'col3': ['abc','def','ghi','jkl']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  jkl

#### .unique()
Este método padrão do pandas é utilizado para verificar valores que tenham repetição em uma determinada coluna, no caso do nosso exemplo, este método, apenas faria sentido aplicado na coluna "col2", pois é a unica coluna onde há valores repetidos.

In [85]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

Há um colando equivalente no NumPy.

In [86]:
np.unique(df['col2'])

array([444, 555, 666], dtype=int64)

Para "medirmos" o tamanho do vetor retornado pela operação, podemos utilizar as seguinte maneira.

In [87]:
len(df['col2'].unique())

3

Ou com este método, também padrão no pandas.

In [88]:
df['col2'].nunique()

3

#### .value_counts()
Neste método podemos contar quantos itens repetidos temos dentro da determinada coluna

In [89]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

Como pode ver, ele retorna que há 2 itens de "444" na coluna "col2".

#### Utilização de funções criadas
Abaixo conterá um exemplo de como podemos utilizar funções, que nós mesmos criamos ao longo do programa, em nossos DataFrames.

In [90]:
def quadrado(x):
    return x**2

In [91]:
df['col1'].apply(quadrado)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

Utilizamos o método apply e passamos em seu parâmetro a função que criamos.

#### del 
Podemos utilizar esta função padrão do Python, para deletar uma coluna da nossa tabela.

In [92]:
del df['col2']

In [93]:
df

   col1 col3
0     1  abc
1     2  def
2     3  ghi
3     4  jkl

In [94]:
df = pd.DataFrame({'col1': [1,2,3,4], 'col2': [444,555,666,444], 'col3': ['abc','def','ghi','jkl']})

#### .sort_values()
Com este método podemos organizar os valores do DataFrame.

In [95]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  jkl
1     2   555  def
2     3   666  ghi

Aqui organizamos a tabela de forma crescente de acordo com os valores da coluna "col2".

### Entrada e saida de dados

Agora nós vamos criar DataFrames utilizando métodos que o Pandas nos oferece.

Escrevendo "pd.read" e apertando "tab" logo após, irá abrir uma aba onde pode ser visto todos os métodos que podem ser utilizados para a extração de dados.

Os que provávelmente serão mais usados ao longo da vida profissional são os, read_csv, read_excel, read_html.

Cada um deles possuem seus próprios parâmetros para o uso adequado, por isso então, é recomendado que, ao utilizar o método, aperte "shift" + "tab", para que possa ser demostrado todos os parâmetros do método e suas definições padrões.

In [96]:
dfexcel = pd.read_excel("exemplo_excel.xlsx",sheet_name='Plan1')

In [97]:
dfexcel

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

Agora se quisermos realizar alguma operação com a tabela importada, podemos exposta-la, para algum outro arquivo.

In [67]:
dfexcel = dfexcel * 2

In [68]:
dfexcel

    a   b   c
0   0   2   4
1   6   8  10
2  12  14  16

In [98]:
dfexcel.to_excel('Exemplo_Excel.xlsx',sheet_name='Sheet1')

ValueError: ZIP does not support timestamps before 1980